{
  "pigs": [
    {
      "id": 1,
      "habitat": "Broadleaf woodlands and coniferous woodlands",
      "Genus": "Pig",
      "value": 9,
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Wildschwein%2C_N%C3%A4he_Pulverstampftor_%28cropped%29.jpg/1200px-Wildschwein%2C_N%C3%A4he_Pulverstampftor_%28cropped%29.jpg",
      "description": "The wild boar, which is sometimes called the European wild boar, is the largest of the wild pigs and is native to forests ranging from western and northern Europe and North Africa to India, the Andaman Islands, and China. The species is now one of the widest-ranging mammals in the world. The wild boar is a bulky, massively built suid with short and relatively thin legs. The trunk is short and robust, while the hindquarters are comparatively underdeveloped. It is bristly haired, grizzled, and blackish or brown in color and stands up to 90 cm (35 inches) tall at the shoulder.",
      "species": "Wild Boar"
    },
    {
      "id": 2,
      "habitat": "Moist, swampy forests and tropical rain forests",
      "Genus": "Babyrousa",
      "value": 2,
      "image": "http://2.bp.blogspot.com/-B6CfKV9ztaQ/Uxc-y1WXW-I/AAAAAAAAAiY/x-DaKjuoA7Q/s1600/babirusa.jpg",
      "description": "The Babirusas, whose name directly translates to Pig Deer in English, are found in the Indonesian islands of Sulawesi, Togian, Sula and Buru. The Babirusa have remarkable tusks or canine teeth that can grow right up through the skin in their snout and curve back toward their forehead. Babirusas have barrel-shaped bodies with deer-like legs and bristly skin. They are a dull gray or brownish in color and appear naked or hairless. They are about 2 feet tall and 3 feet long and can weigh over 200 pounds.",
      "species": "Babirusa"
    },
    {
      "id": 3,
      "habitat": "Humid highlands, and forests",
      "Genus": "Hylochoerus",
      "value": 7,
      "image": "https://i.pinimg.com/736x/6d/b7/a9/6db7a912bffe3d7f700f898e4a0f172b--forests-earth.jpg",
      "description": "Giant forest hogs are considered the largest wild member of the pig family. They occur in the west and central Africa, where they are largely restricted to the Guinean and Congolese forests. Adults can measure from 1.3 to 2.1 m in head-and-body length and 25 to 45 cm in tail length. They have extensive hairs on their body, which become less pronounced with age. They are mostly black in color on the surface, though hairs nearest the skin are a deep orange color. The ears are large and pointy, and the tusks of a male may reach a length of 36 centimeters. Females in this species are generally smaller than males.",
      "species": "Giant Forest Hog"
    },
    {
      "id": 4,
      "habitat": "Forests, savannas, swamps, and grasslands",
      "Genus": "Potamochoerus",
      "value": 10,
      "image": "https://thealexandriazoo.com/images/animals/RedRiverHog02.jpg",
      "description": "Red river hogs are the smallest of the African pigs on average, growing to 40 to 50 inches (102 to 127 centimeters) in length and weighing 100 to 285 pounds (45 to 129 kilograms). It has striking orange to reddish-brown fur, with black legs and a tufted white stripe along the spine. They have fur on the jaw and the flanks that is longer than that on the body. The ones found in West Africa are predominantly red with a white stripe along their backs, while those found in the eastern and southern habitats can be red, brown or black, sometimes becoming darker with age. ",
      "species": "Red River Hog"
    },
    {
      "id": 5,
      "habitat": "Forests, woodland, riverine vegetation and cultivated areas",
      "Genus": "Potamochoerus",
      "value": 5,
      "image": "https://t4.ftcdn.net/jpg/03/84/96/49/360_F_384964908_nSN3DLN3magCkJ5AzvNJGlVV8u73t2KW.jpg",
      "description": "Bush pigs are members of the pig family. They are found in East and Southern Africa. Bush Pigs are found in Ethiopia, Somalia, Eastern and Southern DR Congo, Cape and KwaZulu-Natal Province in South Africa. They resemble the domestic pig and can be identified by their blunt, muscular snouts, small eyes, pointed, tufted ears, and buckled toes. Their color varies from reddish brown to dark brown and becomes darker with age. Both sexes have a lighter-colored mane which bristles when the animal becomes agitated. The upper parts of the face and ears are also lighter in color with sharp tusks that are fairly short.",
      "species": "Bush Pig"
    },
    {
      "id": 6,
      "habitat": "Tall and wet grassland plains",
      "Genus": "Porcula",
      "value": 8,
      "image": "https://www.durrell.org/media/tg1h4svk/_cmj3174-rt.jpeg?center=0.52560664879070451,0.80256394321682534&mode=crop&quality=90&width=1680&height=1120&rnd=132893257607270000",
      "description": "The Pygmy hog is the smallest and the rarest wild pig in the world. An adult pygmy hog usually weighs between 14.5 to 21 pounds. From its hoof to its shoulder, the pygmy hog ranges from about 8-10 inches. It's coat is brown with a few dark hairs and its head is tapered with a slight crest of hair on the forehead and on the back of its neck. They can be found only in southern Bhutan and in Assam, India. Its skin is dark brownish-black in color and it has hazel brown eyes. Piglets are born grayish-pink, becoming brown with yellow stripes along the body length. Adult males have the upper canines visible on the sides of their mouths. ",
      "species": "Pygmy Hog"
    },
    {
      "id": 7,
      "habitat": "Open arid countryside including thin woodland with scattered trees, xerophytic scrubland, and sandy plains",
      "Genus": "Phacochoerus",
      "value": 4,
      "image": "http://www.wildsolutions.nl/wp-content/uploads/De-Jong-Butynski-desert-warthog-Samburu-NR-17-550x407.jpg",
      "description": "Desert Warthogs are stockily-built animals with males being larger than females. They have a rather flattened head with facial paired warts and large curving canine teeth that protrude as tusks. Their body is covered with bristly hairs. The tail is long and thin and is tipped with a small brush of coarse hair. Desert warthogs are generally mid to dark brown in color. Desert warthogs are native to Northeast Africa but are found in Southeastern Ethiopia, Western Somalia,and Eastern and Central Kenya.",
      "species": "Desert warthog"
    },
    {
      "id": 8,
      "habitat": "Rain forests and mangrove forests",
      "Genus": "Sus barbatus",
      "value": 3,
      "image": "https://images.theconversation.com/files/213392/original/file-20180405-189830-3nciwj.jpg?ixlib=rb-1.1.0&rect=0%2C60%2C1500%2C1039&q=45&auto=format&w=926&fit=clip",
      "description": "The Bornean bearded pig, also known as the Sunda bearded pig, can be recognized by their prominent beard which is more pronounced in males. They also sometimes have tassels on their tail. They are usually pale gray in color, but may vary from reddish-brown, dark brown, or very pale. Males have two pairs of small facial warts which are hidden within the beard. Both sexes are similar in appearance and have sharp tusks. Bornean bearded pigs are found in Southeast Asia. They occur in Sumatra, Borneo, the Malay Peninsula, and various smaller islands like in Sulu archipelago such as Tawi-Tawi.",
      "species": "Bornean bearded pig"
    },
    {
      "id": 9,
      "habitat": "Dense forested areas and grasslands",
      "Genus": "Sus cebifrons",
      "value": 6,
      "image": "https://s36593.pcdn.co/wp-content/uploads/2020/02/Pig-VisayanWartyHogMale-TM.jpg",
      "description": "The Visayan warty pig is a small, forest-dwelling pig, little known, and only recently recognized as a distinct species. The males or boars are much larger than the females or sows, and, unique amongst wild pigs, grow crests and manes during the breeding season that are as long as 23 cm. They are named after the islands where they live, and because of the three pairs of warts on the face of male pigs, which may help protect their face when fighting. They are endemic to six islands in the Philippines: Cebu, Negros, Panay, Masbate, Guimaras, and Siquijor. However, only Negros and Panay have documented remaining populations of Visayan warty pigs.",
      "species": "Visayan warty pig"
    },
    {
      "id": 10,
      "habitat": "Lives in a yellow house on a hill and speaks English with a British accent",
      "Genus": "Blackstone Adventure",
      "value": 11,
      "image": "https://ahchealthenewscdn.azureedge.net/wp-content/uploads/2019/04/bacon.jpg",
      "description": "Peppa Pig is a 4 year old little pig who loves playing with her friends and playing with her little brother George. The characters, such as Peppa, wear clothes, live in houses, and drive cars, but still display some characteristics of the animals on which they are based. Peppa and her family snort like pigs during conversations in which they are speaking English and the other animals make their respective noises when they talk. The characters blush when embarrassed, and their mouths express other emotions such as sadness, happiness, irritation, bewilderment, and confusion",
      "species": "Peppa Pig"
    },
    {
      "id": 11,
      "habitat": "Oklahoma",
      "Genus": "Sus domesticus",
      "value": "",
      "image": "https://www.breedslist.com/wp-content/uploads/2016/09/Choctaw-Hog.jpg",
      "description": "The Choctaw hogs are black and sometimes have white markings. They are relatively small for a domestic pig and have droopy ears. Their toes are typically fused forming a single hoof like that of a mule. Many of them have fleshy wattles on each side of their necks. They are a pure Spanish breed and are quick and athletic pigs with heavy forequarters. The average live body weight of the mature boars is around 110-136 kg. They are now reduced in population to some hundred animals. The Choctaw people and their livestock migrated from the Deep South to Oklahoma Territory in the early 19th century.The Choctaw tribe still raises these hogs in Oklahoma ",
      "species": "Choctaw Hog"
    },
    {
      "id": 12,
      "habitat": "adaptable and thrive in a wide variety of climates.",
      "Genus": "Sus domesticus",
      "value": "",
      "image": "https://livestockconservancy.org/wp-content/uploads/2022/08/Hereford-scaled.jpg",
      "description": "Herefords are a medium-size hog that is unique to the United States. It's face is of white color and is of medium length which is slight dished. It was developed in Iowa and Nebraska during the 1920s from Duroc, Chester White, and Poland China bloodlines. These hogs are primarily red, with a white face and two or more white feet. It is a pig of medium size: mature sows weigh about 270 kg (600 lb) and boars about 360 kg (800 lb). Today, the breed population is estimated at fewer than 2,000 pigs in the United States, most of them found in the upper Midwest and Plains states.",
      "species": "Hereford Hog"
    },
    {
      "id": 13,
      "habitat": "Forest, Orchard, and Pastured land",
      "Genus": "Sus domesticus",
      "value": "",
      "image": "https://morningchores.com/wp-content/uploads/2020/09/American-Guinea-Hog-1.jpg",
      "description": "The Guinea Hog is a small and black swine breed. There are two types of Guinea hog in North America, small-boned and large-boned Guinea hogs, the latter having longer legs. Prior to 2006, this pig was referred to as Guinea Hog, Guinea Forest Hog, or “yard pig.” Some have reddish tinges to their ears or develop maroon shading. The American Guinea Hog is a rare breed with a black coat, sturdy body, curly tail and large, red breed with upright ears, bristly hair and long tails. They were imported from West Africa and the Canary Islands to America in conjunction with the slave trade. They weigh around 69 to 135 kg (150 to 300 lb).  ",
      "species": "Guinea Hog"
    },
    {
      "id": 14,
      "habitat": "grasslands, forest and areas of parang, from sea level to the mountains",
      "Genus": "Sus philippensis",
      "value": "",
      "image": "http://images.summitmedia-digital.com/esquiremagph/images/2022/04/19/1-panel%20(10).png",
      "description": "Philippine warty pigs, also known as baboy damo, have two pairs of warts, with a tuft of hair extending outwards from the warts closest to the jaw. There are at least two recognized subspecies of the Philippine warty pig. The S. P. Philippensis, which is found in Luzon and S. P. Mindanensis, which is found in Mindanao. They were mostly found in Luzon, Biliran, Samar, Leyte, Mindoro, Mindanao, Jolo, Polillo, Catanduanes, and possibly other islands. It was formerly found in most habitats (from sea level to up to 2800 m) but is now confined to remote forests due to loss of habitat and heavy hunting.",
      "species": "Philippine warty pig"
    },
    {
      "id": 15,
      "habitat": "rain forest, swamp, cultivated land and grassland",
      "Genus": "Sus Celebensis",
      "value": "",
      "image": "https://static.inaturalist.org/photos/71492172/large.jpg",
      "description": "The Celebes warty pig is a medium-sized pig, and quite variable in size and appearance. This pig has a head-and-body length of between 80 and 130 cm (30 and 50 in) and a long tail. The color is grayish-black, sometimes tinged with red or yellow on the flanks. It has three pairs of facial warts and a fringe of pale bristles on the snout and more bristles on the cheeks. The crown and nape are topped by a short crest of dark bristles, while a stripe extends from the crest towards the tufted tail. The  pig occurs in Sulawesi, Buton, Muna, Kabeana, Peleng, Lembeh and the Togian Islands.",
      "species": "Sulawesi Warty Pig"
    },
    {
      "id": 16,
      "habitat": "open woodland areas with water nearby",
      "Genus": "Sus domesticus",
      "value": "",
      "image": "https://e222ekm2n8r.exactdn.com/wp-content/uploads/2021/11/Gallery-PotBelliedPig03.jpeg?strip=all&lossy=1&ssl=1",
      "description": "The Vietnamese Pot-bellied has uniformly black with heavily wrinkled skin. It has a pronounced sway back and a large sagging belly. The head is small, with an up-turned snout, small ears and eyes, and heavy sagging jowls. It was originally from Vietnam but are also in America now. An adult Vietnamese pot-bellied pig’s body length is around three feet and they weigh from 70 to 175 pounds.",
      "species": "Vietnamese Pot-bellied"
    },
    {
      "id": 17,
      "habitat": "woodland habitats, farmlands, grasslands, meadows, and pastures",
      "Genus": "Sus domesticus",
      "value": "",
      "image": "https://cdn.iamcountryside.com/wp-content/uploads/2019/02/cal-pig-10.jpeg",
      "description": "The Kunekune are a small breed of domestic pig from New Zealand. It is covered in hair which can be long or short, and straight or curly. Hair colors include black, brown, ginger, gold, cream, and spotted combinations. It has a medium to short, slightly upturned snout, often black, and either semi-lopped or pricked ears. It has a short, round body with short legs and may have two wattles under its chin. It stands about 60 cm (24 in) tall. An adult Kunekune can weigh between 60 and 200 kg (130 and 440 lb).",
      "species": "Kunekune"
    },
    {
      "id": 18,
      "habitat": "all major forest types and forest-grassland mosaics ",
      "Genus": "Sus ahoenobarbus",
      "value": "",
      "image": "https://64.media.tumblr.com/b3d98bf0e2d9a020bd433324d3063c58/tumblr_pr3t23T02R1xwu4tvo1_1280.jpg",
      "description": "The Palawan bearded pig is the largest wild pig in the Philippines. It's body is dark gray to black in color, with the neck, trunk and limbs all covered in somewhat sparse black hair. A mane of longer pale-tipped hairs extends along the centre of the back; this is most prominent on the back of the head and neck. The tail is covered with long, black hair, and has a distinct feather-like brush of long hair at the tip. The long, narrow head ends with a nasal disc.",
      "species": "Palawan bearded pig"
    },
    {
      "id": 19,
      "habitat": "Indonesia",
      "Genus": "Sus scrofa vittatus",
      "value": "",
      "image": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Banded_Pig_%28Sus_scrofa_vittatus%29_%288750051577%29.jpg",
      "description": "The banded pig, also known as the Indonesian wild boar, is a short-faced subspecies with a white band on the muzzle, as well as sparse body hair, no under-wool, a fairly long mane, and a broad reddish band extending from the muzzle to the sides of the neck. It is found on many Indonesian Islands such as Sumatra, Java, and the Lesser Sundas as far east as Komodo.",
      "species": " Banded Pig"
    },
    {
      "id": 20,
      "habitat": "primary forests, secondary scrub, swamps, and beaches",
      "Genus": "Babyrousa togeanensis",
      "value": "",
      "image": "https://upload.wikimedia.org/wikipedia/commons/a/af/Babyrousa_togeanensis.jpg",
      "description": "The Togian babirusa, also known as the Malenge babirusa, are the largest of their kind. They are found mainly in four islands: Batudaka, Togean, Talatakoh, and Malenge. Their body is covered with long (but sparse) hair that may range in color from pale fawn to black; as a result, the overall color varies between individuals from nearly golden to almost black. Distinctively, the belly and insides of the legs are whitish, and this pale coloration may extend to the upper lip, contrasting with the forehead which is often dark. The tail has a well-developed terminal tuft of hair. ",
      "species": "Togian babirusa"
    }
  ]
}